/* 
* Filename:    writeTime.ino
* Revision:    1.0
* Date:        2019/06/03
* Author:      hceng
* Email:       huangcheng.job@foxmail.com
* Website:     http://www.100ask.net/
* Function:    Write Real Time ClockM.
* Notes:       Onboard RTC at I2C0.
* Description: 
* 1. 实例化RTC，传入参数为对应的I2C接口编号；
* 2. 设置rtc的各个参数，含义/范围如下：
+----------+-----------+------------+-----------------------------------------+
| variable |  meaning  |    range   |                   note                  |
+----------+-----------+------------+-----------------------------------------+
|   year   |     年    |  2000-2099 |                                         |
+----------+-----------+------------+-----------------------------------------+
|   month  |     月    |    1-12    |                                         |
+----------+-----------+------------+-----------------------------------------+
|    day   |     日    |    1-31    |                                         |
+----------+-----------+------------+-----------------------------------------+
|   week   |    星期   |     0-6    |       0为周日，1为星期一，以此类推      |
+----------+-----------+------------+-----------------------------------------+
|   hour   |     时    | 1-12/00-23 |         12进制/24进制分别值范围         |
+----------+-----------+------------+-----------------------------------------+
|  minute  |     分    |    0-59    |                                         |
+----------+-----------+------------+-----------------------------------------+
|  second  |     秒    |    0-59    |                                         |
+----------+-----------+------------+-----------------------------------------+
|    h12   | 12/24进制 |     0/1    |           0为24进制，1为12进制          |
+----------+-----------+------------+-----------------------------------------+
|    am    | 上午/下午 |     0/1    | 0为下午，1为上午，且只在h12=1时才能设置 |
+----------+-----------+------------+-----------------------------------------+
* 2. 使用setTime()设置时间；
* 3. 循环里，间隔1S,使用timePrintf()打印RTC模块时间
*/
#include <Arduino.h>
#include <rtc.h>

int main(int argc, char **argv)
{
	RTC rtc(1);
	
	rtc.year = 2019;
	rtc.month = 6;
	rtc.day = 3;
	rtc.week = 1;
#if 0
	rtc.h12 = H12; 
	rtc.am = 0;
	rtc.hour = 11;
#else
	rtc.h12 = H24; 
	rtc.hour = 23;	
#endif
	rtc.minute = 59;
	rtc.second = 57;
	
	rtc.setTime();
	
	while(1)
	{
		rtc.timePrintf();
		sleep(1);
	} 
	
}
